imbluedabr/m33mu/cpu/stm32h563/stm32h563_mmio.c
/* m33mu -- an ARMv8-M Emulator
 *
 * Copyright (C) 2025  Daniele Lacamera <root@danielinux.net>
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU Affero General Public License as published
 * by the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU Affero General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 *
 * SPDX-License-Identifier: AGPL-3.0-or-later
 *
 */

#include <string.h>
#include <sys/random.h>
#include <stdlib.h>
#include <stdio.h>
#include "m33mu/pka.h"
#ifdef M33MU_HAS_WOLFSSL
#include <wolfssl/options.h>
#include <wolfssl/wolfcrypt/settings.h>
#include <wolfssl/wolfcrypt/aes.h>
#include <wolfssl/wolfcrypt/sha.h>
#include <wolfssl/wolfcrypt/sha256.h>
#include <wolfssl/wolfcrypt/sha512.h>
#endif
#include "stm32h563/stm32h563_mmio.h"
#include "stm32h563/stm32h563_usb.h"
#include "stm32h563/stm32h563_eth.h"
#include "stm32h563/stm32h563_i2c.h"
#include "m33mu/memmap.h"
#include "m33mu/flash_persist.h"
#include "m33mu/otp.h"
#include "m33mu/spi_bus.h"
#include "m33mu/gpio.h"
#include "m33mu/nvic.h"
#include "stm32_crypto.h"
#include "stm32_gpio.h"
#include "stm32_gpdma.h"

extern void mm_system_request_reset(void);

/* RCC base addresses (system domain) */
#define RCC_BASE     0x44020c00u
#define RCC_SEC_BASE 0x54020c00u
#define RCC_SIZE     0x400u

#define RCC_CR       0x000u
#define RCC_CFGR1    0x01cu
#define RCC_CFGR2    0x020u
#define RCC_PLL1CFGR 0x028u
#define RCC_PLL1DIVR 0x034u
#define RCC_PLL2CFGR 0x02cu
#define RCC_PLL3CFGR 0x030u
#define RCC_PLL2DIVR 0x03cu
#define RCC_PLL2FRACR 0x040u
#define RCC_PLL3DIVR 0x044u
#define RCC_PLL3FRACR 0x048u
#define RCC_BDCR     0x0f0u

/* PWR base (system domain) */
#define PWR_BASE     0x44020800u
#define PWR_SEC_BASE 0x54020800u
#define PWR_SIZE     0x400u
/* TAMP base */
#define TAMP_BASE     0x44007C00u
#define TAMP_SEC_BASE 0x54007C00u
#define TAMP_SIZE     0x400u
/* SBS base (system domain) */
#define SBS_BASE     0x44000400u
#define SBS_SEC_BASE 0x54000400u
#define SBS_SIZE     0x400u
/* BSEC base (system domain) */
#define BSEC_BASE    0x46009000u
#define BSEC_SIZE    0x400u

/* FLASH controller base */
#define FLASH_BASE   0x40022000u
#define FLASH_SEC_BASE 0x50022000u
#define FLASH_SIZE   0x400u

#define FLASH_OTP_BASE_NS 0x08FFF000u
#define FLASH_OTP_BASE_S  0x0CFFF000u
#define FLASH_OTP_SIZE    0x800u
#define FLASH_OTP_BLOCK_SIZE 64u
#define FLASH_OTP_BLOCK_COUNT 32u

/* GTZC TZSC/TZIC (secure / non-secure aliases) */
#define GTZC_TZSC_S_BASE 0x50032400u
#define GTZC_TZSC_NS_BASE 0x40032400u
#define GTZC_TZIC_S_BASE 0x50032800u
#define GTZC_TZIC_NS_BASE 0x40032800u
#define GTZC_TZSC_SIZE 0x400u
#define GTZC_TZIC_SIZE 0x400u
#define GTZC_BLK_SIZE 0x1000u

/* ICACHE/DCACHE base addresses (secure / non-secure aliases) */
#define ICACHE_BASE     0x40030400u
#define ICACHE_SEC_BASE 0x50030400u
#define DCACHE_BASE     0x40031400u
#define DCACHE_SEC_BASE 0x50031400u
#define CACHE_SIZE      0x400u

/* RNG base addresses */
#define RNG_BASE     0x420c0800u
#define RNG_SEC_BASE 0x520c0800u
#define RNG_SIZE     0x400u

/* AES/HASH/SAES/PKA base addresses */
#define AES_BASE     0x420c0000u
#define AES_SEC_BASE 0x520c0000u
#define AES_SIZE     0x400u
#define HASH_BASE     0x420c0400u
#define HASH_SEC_BASE 0x520c0400u
#define HASH_SIZE     0x400u
#define SAES_BASE     0x420c0c00u
#define SAES_SEC_BASE 0x520c0c00u
#define SAES_SIZE     0x400u
#define PKA_BASE     0x420c2000u
#define PKA_SEC_BASE 0x520c2000u
#define PKA_SIZE     0x2000u

/* MPCBB base addresses */
#define MPCBB1_BASE     0x40032c00u
#define MPCBB1_SEC_BASE 0x50032c00u
#define MPCBB2_BASE     0x40033000u
#define MPCBB2_SEC_BASE 0x50033000u
#define MPCBB3_BASE     0x40033400u
#define MPCBB3_SEC_BASE 0x50033400u
#define MPCBB_SIZE      0x400u

/* EXTI base addresses */
#define EXTI_BASE     0x44022000u
#define EXTI_SEC_BASE 0x54022000u
#define EXTI_SIZE     0x400u

/* DBGMCU base address */
#define DBGMCU_BASE   0x44024000u
#define DBGMCU_SIZE   0x1000u

/* IWDG/WWDG base addresses */
#define IWDG_BASE     0x40003000u
#define IWDG_SEC_BASE 0x50003000u
#define IWDG_SIZE     0x400u
#define WWDG_BASE     0x40002C00u
#define WWDG_SEC_BASE 0x50002C00u
#define WWDG_SIZE     0x400u

/* UCPD1 base addresses */
#define UCPD1_BASE     0x4000DC00u
#define UCPD1_SEC_BASE 0x5400DC00u
#define UCPD1_SIZE     0x400u

/* CRS base addresses */
#define CRS_BASE     0x40006000u
#define CRS_SEC_BASE 0x50006000u
#define CRS_SIZE     0x400u

/* UCPD1 register offsets (subset) */
#define UCPD_CFGR1 0x000u
#define UCPD_CR    0x00Cu
#define UCPD_IMR   0x010u
#define UCPD_SR    0x014u
#define UCPD_ICR   0x018u

/* UCPD1 bits (subset) */
#define UCPD_CFGR1_UCPDEN (1u << 31)
#define UCPD_CR_ANAMODE   (1u << 9)
#define UCPD_CR_CCENABLE_0 (1u << 10)
#define UCPD_CR_CCENABLE_1 (1u << 11)
#define UCPD_CR_CCENABLE_BOTH (UCPD_CR_CCENABLE_0 | UCPD_CR_CCENABLE_1)
#define UCPD_SR_TYPECEVT1 (1u << 14)
#define UCPD_SR_TYPECEVT2 (1u << 15)
#define UCPD_SR_TYPEC_VSTATE_CC1_Pos 16u
#define UCPD_SR_TYPEC_VSTATE_CC2_Pos 18u
#define UCPD_SR_TYPEC_VSTATE_CC_Msk (0x3u << UCPD_SR_TYPEC_VSTATE_CC1_Pos)
#define UCPD_SR_TYPEC_VSTATE_CC2_Msk (0x3u << UCPD_SR_TYPEC_VSTATE_CC2_Pos)
#define UCPD_ICR_TYPECEVT1CF (1u << 14)
#define UCPD_ICR_TYPECEVT2CF (1u << 15)

#define RNG_CR_OFFSET   0x0u
#define RNG_SR_OFFSET   0x4u
#define RNG_DR_OFFSET   0x8u
#define RNG_NSCR_OFFSET 0xcu
#define RNG_HTCR_OFFSET 0x10u

/* AES register offsets (subset) */
#define AES_CR    0x000u
#define AES_SR    0x004u
#define AES_DINR  0x008u
#define AES_DOUTR 0x00cu
#define AES_KEYR0 0x010u
#define AES_KEYR1 0x014u
#define AES_KEYR2 0x018u
#define AES_KEYR3 0x01cu
#define AES_IVR0  0x020u
#define AES_IVR1  0x024u
#define AES_IVR2  0x028u
#define AES_IVR3  0x02cu
#define AES_KEYR4 0x030u
#define AES_KEYR5 0x034u
#define AES_KEYR6 0x038u
#define AES_KEYR7 0x03cu
#define AES_IER   0x300u
#define AES_ISR   0x304u
#define AES_ICR   0x308u

