imbluedabr/m33mu/cpu/stm32h563/stm32h563_mmio.c
#define RNG_IRQ 114
static const mm_u32 mpcbb_words[] = { 32u, 32u, 32u };

static mm_u32 stm32h563_gpio_bank_read(void *opaque, int bank);
static mm_u32 stm32h563_gpio_bank_read_moder(void *opaque, int bank);
static mm_bool stm32h563_gpio_bank_clock(void *opaque, int bank);
static mm_u32 stm32h563_gpio_bank_read_seccfgr(void *opaque, int bank);
static void exti_gpio_update(int bank, mm_u32 old_level, mm_u32 new_level);
static mm_bool stm32h563_gpio_clock_enabled_cb(int bank);
static void exti_gpio_update_cb(int bank, mm_u32 old_level, mm_u32 new_level);
static mm_bool hash_requires_secure(const struct simple_blk *tzsc);
static mm_bool aes_requires_secure(const struct simple_blk *tzsc, mm_bool is_saes);
static mm_bool pka_requires_secure(const struct simple_blk *tzsc);

static void ucpd_update_attach(struct ucpd_state *u)
{
    if (u == 0) {
        return;
    }
    if ((u->cfgr1 & UCPD_CFGR1_UCPDEN) == 0u) {
        return;
    }
    if ((u->cr & (UCPD_CR_ANAMODE | UCPD_CR_CCENABLE_BOTH)) != (UCPD_CR_ANAMODE | UCPD_CR_CCENABLE_BOTH)) {
        return;
    }
    if ((u->sr & (UCPD_SR_TYPECEVT1 | UCPD_SR_TYPECEVT2)) == 0u) {
        u->sr |= UCPD_SR_TYPECEVT1;
    }
    u->sr &= ~(UCPD_SR_TYPEC_VSTATE_CC_Msk | UCPD_SR_TYPEC_VSTATE_CC2_Msk);
    u->sr |= (3u << UCPD_SR_TYPEC_VSTATE_CC1_Pos);
}

static mm_bool ucpd_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct ucpd_state *u = (struct ucpd_state *)opaque;
    mm_u32 value = 0;
    if (u == 0 || value_out == 0) {
        return MM_FALSE;
    }
    if (size_bytes != 4u) {
        return MM_FALSE;
    }
    ucpd_update_attach(u);
    switch (offset) {
    case UCPD_CFGR1:
        value = u->cfgr1;
        break;
    case UCPD_CR:
        value = u->cr;
        break;
    case UCPD_IMR:
        value = u->imr;
        break;
    case UCPD_SR:
        value = u->sr;
        break;
    default:
        value = 0;
        break;
    }
    *value_out = value;
    return MM_TRUE;
}

static mm_bool ucpd_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct ucpd_state *u = (struct ucpd_state *)opaque;
    if (u == 0) {
        return MM_FALSE;
    }
    if (size_bytes != 4u) {
        return MM_FALSE;
    }
    switch (offset) {
    case UCPD_CFGR1:
        u->cfgr1 = value;
        ucpd_update_attach(u);
        return MM_TRUE;
    case UCPD_CR:
        u->cr = value;
        ucpd_update_attach(u);
        return MM_TRUE;
    case UCPD_IMR:
        u->imr = value;
        return MM_TRUE;
    case UCPD_ICR:
        if ((value & UCPD_ICR_TYPECEVT1CF) != 0u) {
            u->sr &= ~UCPD_SR_TYPECEVT1;
        }
        if ((value & UCPD_ICR_TYPECEVT2CF) != 0u) {
            u->sr &= ~UCPD_SR_TYPECEVT2;
        }
        return MM_TRUE;
    default:
        return MM_TRUE;
    }
}

static mm_bool hash_clock_enabled(const struct rcc_state *rcc)
{
    return ((rcc->regs[0x8c / 4u] >> 17) & 1u) != 0u;
}

static mm_bool aes_clock_enabled(const struct rcc_state *rcc, mm_bool is_saes)
{
    mm_u32 bit = is_saes ? 20u : 16u;
    return ((rcc->regs[0x8c / 4u] >> bit) & 1u) != 0u;
}

static mm_bool pka_clock_enabled(const struct rcc_state *rcc)
{
    return ((rcc->regs[0x8c / 4u] >> 19) & 1u) != 0u;
}



static mm_bool flash_trace_enabled(void)
{
    static mm_bool init = MM_FALSE;
    static mm_bool enabled = MM_FALSE;
    if (!init) {
        const char *env = getenv("M33MU_FLASH_TRACE");
        enabled = (env != 0 && env[0] != '\0') ? MM_TRUE : MM_FALSE;
        init = MM_TRUE;
    }
    return enabled;
}

static mm_bool stm32h563_rcc_clock_list_line(void *opaque, int line, char *out, size_t out_len);

static mm_bool stm32h563_gpio_bank_info(void *opaque, int bank, char *name_out, size_t name_len, int *pins_out)
{
    (void)opaque;
    if (bank < 0 || bank >= 9) {
        return MM_FALSE;
    }
    if (name_out != 0 && name_len > 0u) {
        name_out[0] = (char)('A' + bank);
        if (name_len > 1u) {
            name_out[1] = '\0';
        }
    }
    if (pins_out != 0) {
        *pins_out = 16;
    }
    return MM_TRUE;
}

void mm_stm32h563_mmio_reset(void)
{
    size_t i;
    mm_u32 optsr_swap = flash_ctl.regs[FLASH_OPTSR_CUR / 4u] & FLASH_OPTSR_SWAP_BANK;
    mm_bool dualbank = flash_ctl.dualbank_enabled;
    memset(&rcc, 0, sizeof(rcc));
    memset(&pwr, 0, sizeof(pwr));
    memset(&tzsc_s, 0, sizeof(tzsc_s));
    memset(&tzsc_ns, 0, sizeof(tzsc_ns));
    memset(&tzic_s, 0, sizeof(tzic_s));
    memset(&tzic_ns, 0, sizeof(tzic_ns));
    memset(&sbs, 0, sizeof(sbs));
    memset(&sbs_sec, 0, sizeof(sbs_sec));
    memset(&tamp, 0, sizeof(tamp));
    memset(&bsec, 0, sizeof(bsec));
    memset(&ucpd1, 0, sizeof(ucpd1));
    memset(&ucpd1_sec, 0, sizeof(ucpd1_sec));
    memset(&ucpd1_state, 0, sizeof(ucpd1_state));
    memset(&ucpd1_state_sec, 0, sizeof(ucpd1_state_sec));
    memset(&crs, 0, sizeof(crs));
    memset(&crs_sec, 0, sizeof(crs_sec));
    memset(&dbgmcu, 0, sizeof(dbgmcu));
    memset(&icache, 0, sizeof(icache));
    memset(&dcache, 0, sizeof(dcache));
    memset(&rng, 0, sizeof(rng));
    memset(&hash_accel, 0, sizeof(hash_accel));
    memset(&aes_accel, 0, sizeof(aes_accel));
    memset(&saes_accel, 0, sizeof(saes_accel));
    memset(&pka_accel, 0, sizeof(pka_accel));
    memset(&exti, 0, sizeof(exti));
    memset(&iwdg, 0, sizeof(iwdg));
    memset(&wwdg, 0, sizeof(wwdg));
    memset(&flash_ctl, 0, sizeof(flash_ctl));
    flash_ctl.dualbank_enabled = dualbank;
    flash_ctl.swap_active = (optsr_swap != 0u) ? MM_TRUE : MM_FALSE;
    mpcbb_init_defaults();
    /* Initialize GPDMA with shared implementation */
    gpdma1.instance = 0;
    gpdma1.num_channels = 16;
    gpdma1.irq_base = 27; /* GPDMA1 channel IRQs start at 27 */
    stm32_gpdma_reset(&gpdma1);
    gpdma2.instance = 1;
    gpdma2.num_channels = 16;
    gpdma2.irq_base = 43; /* GPDMA2 channel IRQs start at 43 */
    stm32_gpdma_reset(&gpdma2);
    /* Initialize GPIO with shared implementation */
    for (i = 0; i < sizeof(gpio) / sizeof(gpio[0]); ++i) {
        stm32_gpio_reset(&gpio[i], (int)i);
        gpio_ctx_data[i * 2].gpio = &gpio[i];
        gpio_ctx_data[i * 2].is_secure_alias = MM_FALSE;
        gpio_ctx_data[i * 2].bank_index = (int)i;
        gpio_ctx_data[i * 2].clock_enabled = stm32h563_gpio_clock_enabled_cb;
        gpio_ctx_data[i * 2].exti_update = exti_gpio_update_cb;
        gpio_ctx_data[i * 2 + 1].gpio = &gpio[i];
        gpio_ctx_data[i * 2 + 1].is_secure_alias = MM_TRUE;
        gpio_ctx_data[i * 2 + 1].bank_index = (int)i;
        gpio_ctx_data[i * 2 + 1].clock_enabled = stm32h563_gpio_clock_enabled_cb;
        gpio_ctx_data[i * 2 + 1].exti_update = exti_gpio_update_cb;
    }
    mm_stm32h563_usb_reset();
    mm_stm32h563_eth_reset();
    mm_stm32h563_i2c_reset();
    mm_gpio_bank_set_reader(stm32h563_gpio_bank_read, 0);
    mm_gpio_bank_set_moder_reader(stm32h563_gpio_bank_read_moder, 0);
    mm_gpio_bank_set_clock_reader(stm32h563_gpio_bank_clock, 0);
    mm_gpio_bank_set_seccfgr_reader(stm32h563_gpio_bank_read_seccfgr, 0);
    mm_gpio_set_bank_info_reader(stm32h563_gpio_bank_info, 0);
    mm_rcc_set_clock_list_reader(stm32h563_rcc_clock_list_line, 0);
    /* Enable HSI by default and mark ready flags. */
    rcc.regs[0] |= 1u;
    /* RCC_AHB2ENR reset value (see STM32H563 SVD). */
    rcc.regs[0x8c / 4u] = 0xC0000000u;
    rcc_update_ready(&rcc);
    rcc_update_sysclk(&rcc);
    iwdg.regs[IWDG_RLR / 4u] = 0x00000FFFu;
    iwdg.regs[IWDG_WINR / 4u] = 0x00000FFFu;
    wwdg.regs[WWDG_CR / 4u] = 0x0000007Fu;
    wwdg.regs[WWDG_CFR / 4u] = 0x0000007Fu;
    wwdg.counter = 0x7Fu;
    exti.regs[EXTI_IMR1 / 4u] = 0xFFFE0000u;
    bsec.regs[BSEC_UID0_OFFSET / 4u] = BSEC_UID0_VALUE;
    bsec.regs[BSEC_UID1_OFFSET / 4u] = BSEC_UID1_VALUE;
    bsec.regs[BSEC_UID2_OFFSET / 4u] = BSEC_UID2_VALUE;
    /* Power ready flags. */
    pwr_update_vos(&pwr);

    /* RNG reset values */
    rng.regs[RNG_CR_OFFSET / 4] = 0x00871f00u;
    rng.regs[RNG_HTCR_OFFSET / 4] = 0x000072acu;
    hash_reset_state(&hash_accel, MM_TRUE);
    mm_pka_reset(&pka_accel);

    /* FLASH reset values */
    flash_ctl.regs[FLASH_ACR / 4] = 0x00000013u;
    flash_ctl.regs[FLASH_NSCR / 4] = 0x00000001u;
    flash_ctl.regs[FLASH_SECCR / 4] = 0x00000001u;
    if ((mm_otp_flags(&otp_state) & MM_OTP_FLAG_FINAL_LOCK) != 0u) {
        flash_ctl.regs[FLASH_OTPBLR_CUR / 4u] = 0xFFFFFFFFu;
    }
    flash_sync_option_regs(&flash_ctl);
}

mm_u32 *mm_stm32h563_tzsc_regs(void)
{
    return tzsc_s.regs;
}

mm_bool mm_stm32h563_mpcbb_block_secure(int bank, mm_u32 block_index)
{
    mm_u32 word;
    mm_u32 bit;
    mm_u32 val;
    mm_bool sec;
    if (bank < 0 || bank >= (int)(sizeof(mpcbb) / sizeof(mpcbb[0]))) {
        return MM_FALSE;
    }
    word = block_index / 32u;
    if (word >= mpcbb_words[bank]) {
        return MM_FALSE;
    }
    bit = block_index % 32u;
    val = mpcbb[bank].regs[(MPCBB_SECCFGR_OFFSET / 4u) + word];
    sec = ((val >> bit) & 1u) != 0u;
    if ((mpcbb[bank].regs[MPCBB_CR_OFFSET / 4u] & MPCBB_CR_INVSECSTATE) != 0u) {
        sec = !sec;
    }
    return sec;
}

static mm_bool gpio_clock_enabled(const struct rcc_state *rcc, int index)
{
    /* AHB2ENR offset 0x8C, GPIOAEN bit0..GPIOIEN bit8 */
    mm_u32 ahb2enr = rcc->regs[0x8c / 4];
    return ((ahb2enr >> index) & 1u) != 0u;
}

static mm_bool stm32h563_gpio_clock_enabled_cb(int bank)
{
    return gpio_clock_enabled(&rcc, bank);
}

static void exti_gpio_update_cb(int bank, mm_u32 old_level, mm_u32 new_level)
{
    exti_gpio_update(bank, old_level, new_level);
    mm_spi_bus_poll_all();
}

