imbluedabr/m33mu/cpu/stm32h563/stm32h563_mmio.c
/* Reset bits currently unused (could clear state if asserted). */

static mm_bool rcc_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct rcc_state *r = (struct rcc_state *)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > RCC_SIZE) return MM_FALSE;
    if (offset <= RCC_CFGR1 && (offset + size_bytes) > RCC_CFGR1) {
        mm_u32 cfgr1 = r->regs[RCC_CFGR1 / 4];
        mm_u32 sw = cfgr1 & 0x7u;
        r->regs[RCC_CFGR1 / 4] = (cfgr1 & ~(0x7u << 3)) | (sw << 3);
    }
    memcpy(value_out, (mm_u8 *)r->regs + offset, size_bytes);
    return MM_TRUE;
}

static void rcc_update_ready(struct rcc_state *r)
{
    mm_u32 cr = r->regs[0]; /* offset 0x0 */
    /* Mirror RDY bits to match ON bits (immediate ready). */
    /* HSIRDY bit1 follows HSION bit0 */
    if ((cr & (1u << 0)) != 0u) cr |= (1u << 1); else cr &= ~(1u << 1);
    /* CSIRDY bit9 follows CSION bit8 */
    if ((cr & (1u << 8)) != 0u) cr |= (1u << 9); else cr &= ~(1u << 9);
    /* HSI48RDY bit13 follows HSI48ON bit12 */
    if ((cr & (1u << 12)) != 0u) cr |= (1u << 13); else cr &= ~(1u << 13);
    /* HSERDY bit17 follows HSEON bit16 */
    if ((cr & (1u << 16)) != 0u) cr |= (1u << 17); else cr &= ~(1u << 17);
    /* PLL1RDY bit25 follows PLL1ON bit24 */
    if ((cr & (1u << 24)) != 0u) cr |= (1u << 25); else cr &= ~(1u << 25);
    /* PLL2RDY bit27 follows PLL2ON bit26 */
    if ((cr & (1u << 26)) != 0u) cr |= (1u << 27); else cr &= ~(1u << 27);
    /* PLL3RDY bit29 follows PLL3ON bit28 */
    if ((cr & (1u << 28)) != 0u) cr |= (1u << 29); else cr &= ~(1u << 29);
    r->regs[0] = cr;
}

static void rcc_update_bdcr(struct rcc_state *r)
{
    mm_u32 bdcr = r->regs[RCC_BDCR / 4];
    if ((bdcr & (1u << 0)) != 0u) bdcr |= (1u << 1); else bdcr &= ~(1u << 1);
    if ((bdcr & (1u << 26)) != 0u) bdcr |= (1u << 27); else bdcr &= ~(1u << 27);
    r->regs[RCC_BDCR / 4] = bdcr;
}

static mm_u64 rcc_pll1_p_clk(const struct rcc_state *r)
{
    mm_u32 pllcfgr = r->regs[RCC_PLL1CFGR / 4];
    mm_u32 plldivr = r->regs[RCC_PLL1DIVR / 4];
    mm_u32 src = pllcfgr & 0x3u;
    mm_u64 fin = 0;
    mm_u32 divm = (pllcfgr >> 8) & 0x3fu;
    mm_u32 n = (plldivr & 0x1ffu) + 1u;
    mm_u32 p = ((plldivr >> 9) & 0x7fu) + 1u;

    if (src == 1u) fin = 64000000ull; /* HSI */
    else if (src == 2u) fin = 4000000ull; /* CSI */
    else if (src == 3u) fin = 8000000ull; /* HSE */
    else fin = 0;

    if (fin == 0 || divm == 0u || p == 0u) {
        return 0;
    }
    return (fin / (mm_u64)divm) * (mm_u64)n / (mm_u64)p;
}

static void rcc_update_sysclk(struct rcc_state *r)
{
    mm_u32 cfgr1 = r->regs[RCC_CFGR1 / 4];
    mm_u32 cfgr2 = r->regs[RCC_CFGR2 / 4];
    mm_u32 sw = cfgr1 & 0x7u;
    mm_u32 hpre = cfgr2 & 0xfu;
    mm_u64 sys = 0;
    mm_u32 div = 1u;

    if (sw == 0u) sys = 64000000ull;
    else if (sw == 1u) sys = 4000000ull;
    else if (sw == 2u) sys = 8000000ull;
    else if (sw == 3u) sys = rcc_pll1_p_clk(r);

    if (hpre >= 8u) {
        switch (hpre) {
        case 8u: div = 2u; break;
        case 9u: div = 4u; break;
        case 10u: div = 8u; break;
        case 11u: div = 16u; break;
        case 12u: div = 64u; break;
        case 13u: div = 128u; break;
        case 14u: div = 256u; break;
        case 15u: div = 512u; break;
        default: div = 1u; break;
        }
    }
    if (sys == 0) {
        r->cpu_hz = 0;
    } else {
        r->cpu_hz = sys / (mm_u64)div;
        if (r->cpu_hz == 0) r->cpu_hz = 1;
    }
    r->regs[RCC_CFGR1 / 4] = (r->regs[RCC_CFGR1 / 4] & ~(0x7u << 3)) | (sw << 3);
}

static mm_bool rcc_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct rcc_state *r = (struct rcc_state *)opaque;
    if (size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > RCC_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)r->regs + offset, &value, size_bytes);
    if (offset == RCC_CR) {
        rcc_update_ready(r);
    }
    if (offset == RCC_BDCR) {
        rcc_update_bdcr(r);
    }
    if (offset == RCC_CFGR1 || offset == RCC_CFGR2 ||
        offset == RCC_PLL1CFGR || offset == RCC_PLL1DIVR ||
        offset == RCC_PLL2CFGR || offset == RCC_PLL3CFGR ||
        offset == RCC_PLL2DIVR || offset == RCC_PLL2FRACR ||
        offset == RCC_PLL3DIVR || offset == RCC_PLL3FRACR ||
        offset == RCC_CR) {
        rcc_update_sysclk(r);
    }
    return MM_TRUE;
}

static mm_bool pwr_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct pwr_state *p = (struct pwr_state *)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > PWR_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)p->regs + offset, size_bytes);
    return MM_TRUE;
}

static void pwr_update_vos(struct pwr_state *p)
{
    mm_u32 voscr = p->regs[0x10 / 4];
    mm_u32 vos = (voscr >> 4) & 0x3u;
    mm_u32 vossr = p->regs[0x14 / 4];
    vossr &= ~((1u << 14) | (1u << 13));
    vossr |= (vos << 14);      /* ACTVOS mirrors VOS */
    vossr |= (1u << 13);       /* ACTVOSRDY set */
    vossr |= (1u << 3);        /* VOSRDY set */
    p->regs[0x14 / 4] = vossr;
}

static void pwr_update_usb(struct pwr_state *p)
{
    mm_u32 usbscr = p->regs[0x38 / 4];
    mm_u32 vmsr = p->regs[0x3c / 4];
    if ((usbscr & (1u << 24)) != 0u && (usbscr & (1u << 25)) != 0u) {
        vmsr |= (1u << 24); /* USB33RDY */
    } else {
        vmsr &= ~(1u << 24);
    }
    p->regs[0x3c / 4] = vmsr;
}

static mm_bool pwr_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct pwr_state *p = (struct pwr_state *)opaque;
    if (size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > PWR_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)p->regs + offset, &value, size_bytes);
    if (offset == 0x10u) {
        pwr_update_vos(p);
    }
    if (offset == 0x38u) {
        pwr_update_usb(p);
    }
    return MM_TRUE;
}

static mm_bool simple_blk_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct simple_blk *b = (struct simple_blk *)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > GTZC_BLK_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)b->regs + offset, size_bytes);
    return MM_TRUE;
}

