imbluedabr/m33mu/cpu/stm32h563/stm32h563_mmio.c
            /* Secure */
            reg.base = base_s + (mm_u32)(i * 0x400u);
            reg.opaque = &gpio_ctx_data[i * 2 + 1];
            if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
        }
    }

    if (!mm_stm32h563_usb_register_mmio(bus)) return MM_FALSE;
    if (!mm_stm32h563_eth_register_mmio(bus)) return MM_FALSE;
    mm_stm32h563_i2c_init(bus, 0);
    return MM_TRUE;
}

void mm_stm32h563_flash_bind(struct mm_memmap *map,
                             mm_u8 *flash,
                             mm_u32 flash_size,
                             const struct mm_flash_persist *persist,
                             mm_u32 flags)
{
    if (map == 0) {
        return;
    }
    flash_ctl.flash = flash;
    flash_ctl.flash_size = flash_size;
    flash_ctl.persist = persist;
    flash_ctl.flags = flags;
    flash_ctl.base_s = map->flash_base_s;
    flash_ctl.base_ns = map->flash_base_ns;
    flash_ctl.dualbank_enabled = (flags & MM_TARGET_FLAG_DUALBANK) != 0u;
    flash_sync_option_regs(&flash_ctl);
    mm_memmap_set_flash_writer(map, flash_write_cb, &flash_ctl);
}

void mm_stm32h563_otp_init(const char *target_name)
{
    mm_otp_init(&otp_state, target_name, FLASH_OTP_SIZE);
}

void mm_stm32h563_rng_set_nvic(struct mm_nvic *nvic)
{
    g_rng_nvic = nvic;
}

void mm_stm32h563_gpdma_set_nvic(struct mm_nvic *nvic)
{
    stm32_gpdma_set_nvic(&gpdma1, nvic);
    stm32_gpdma_set_nvic(&gpdma2, nvic);
}

mm_u8 mm_stm32h563_gpio_get_af(int bank, int pin)
{
    if (bank < 0 || bank >= 9 || pin < 0 || pin >= 16) {
        return 0;
    }
    return stm32_gpio_get_pin_af(&gpio[bank], pin);
}

mm_u8 mm_stm32h563_gpio_get_mode(int bank, int pin)
{
    if (bank < 0 || bank >= 9 || pin < 0 || pin >= 16) {
        return 0;
    }
    return stm32_gpio_get_pin_mode(&gpio[bank], pin);
}
